tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "robotsandpencils/made"

brew "aria2"
brew "bat"
brew "cmake"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnupg"
brew "jq"
brew "mas"
brew "mint"
brew "neovim"
brew "nvm"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "shellcheck"
brew "stgit"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "xclogparser"
brew "zsh-completions"
brew "robotsandpencils/made/xcodes", link: true

#cask "1password" Installed by hand.
cask "alfred"
cask "charles"
cask "font-jetbrains-mono"
cask "fork"
cask "hammerspoon"
cask "istat-menus"
cask "monodraw"
cask "obsidian"
cask "omnifocus"
cask "proxyman"
cask "slack"
cask "xcodes"
cask "xscope"
cask "vivaldi"

mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Instapaper Save", id: 1481302432
mas "Keynote", id: 409183694
mas "Marked 2", id: 890031187
mas "Notchmeister", id: 1599169747
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Playgrounds", id: 1496833156
mas "SF Menu Bar", id: 1615595104
mas "Vinegar", id: 1591303229
