##### How to
# https://robots.thoughtbot.com/brewfile-a-gemfile-but-for-homebrew
# brew tap homebrew/bundle
# brew bundle

# Caskroom
tap "caskroom/cask"

# Development
brew "git"
brew "diff-so-fancy"
brew "fpp"
brew "hub"
brew "heroku"

# Tmux & Vim and Terminal Stuff
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "zsh"
brew "tig"
brew "gnu-sed" # used by diff-so-fancy

# iOS Development
brew "carthage"
brew "rbenv"
brew "swiftlint"
brew "bitrise"

# Swift the compiler
brew "ninja"
brew "python"

# Other Programming
brew "exercism"
brew "haskell-stack"
brew "purescript"

# Writing
brew "multimarkdown"
brew "htmldoc"
brew "pandoc"

# Signing and Security
tap "kryptco"
brew "kr"
brew "keybase"
brew "gnupg"
brew "gpg-agent"
brew "pinentry-mac"

# Ergodox
brew "dfu-util"
