##### How to
# https://robots.thoughtbot.com/brewfile-a-gemfile-but-for-homebrew
# brew tap homebrew/bundle
# brew bundle
#

# Development
brew "git"
brew "diff-so-fancy"
brew "gnu-sed" # used by diff-so-fancy
# CLI program that accepts piped input and presents files for selection
brew "fpp"
# Command-line fuzzy finder written in Go
brew "fzf"
# Add GitHub support to git on the command-line
brew "hub"
tap "heroku/brew"
brew "heroku"

# Tmux & Vim and Terminal Stuff
# Code-search similar to ack
brew "the_silver_searcher"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
brew "macvim"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"

# iOS Development
# Decentralized dependency manager for Cocoa
brew "carthage"
# Ruby version manager
brew "rbenv"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Framework and command-line tool for interacting with SourceKit
brew "sourcekitten"

# Swift the compiler
# Small build system for use with gyp or CMake
brew "ninja"
brew "python"
brew cmake

# Swift Development
#
# Linter, formatter for Swift docstrings.
tap "dduan/formulae"
brew "dduan/formulae/drstring"
#
# Swift documentation generator
tap "swiftdocorg/formulae"
brew "swiftdocorg/formulae/swift-doc"

# Other Programming
#
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
#
# Platform built on V8 to build network applications
brew "node"
# JavaScript package manager
brew "yarn"
#
# Lightweight and flexible command-line JSON processor
brew "jq"

# Writing
# Turn marked-up plain text into well-formatted documents
brew "multimarkdown"
# Convert HTML to PDF or PostScript
brew "htmldoc"
# Swiss-army knife of markup format conversion
brew "pandoc"

# Signing and Security
cask "keybase"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GPG key agent
brew "gpg-agent"
# Pinentry for GPG on Mac
brew "pinentry-mac"

# Ergodox
brew "dfu-util"
# Programmer for Ergodox EZ
cask "zsa-wally"

# Download YouTube videos from the command-line
brew "youtube-dl"
# Screensaver
cask "aerial"
